Revit 2026 API

# CurveByPointFailures Properties

---

The BuiltInFailuresCurveByPointFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UnableToGenerateCurve | Unable to generate valid curve geometry from the driving points. The line by points will be dissolved. |

#### Reference

BuiltInFailuresCurveByPointFailures Class

Autodesk.Revit.DB Namespace